---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderSurfaceGeometry.Create(Autodesk.Revit.DB.Surface,Autodesk.Revit.DB.BoundingBoxUV)
zh: 创建、新建、生成、建立、新增
source: html/8c296707-eb09-33b6-cad8-05e1894b34f2.htm
---
# Autodesk.Revit.DB.BRepBuilderSurfaceGeometry.Create Method

**中文**: 创建、新建、生成、建立、新增

Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface, including Plane and CylSurf.

## Syntax (C#)
```csharp
public static BRepBuilderSurfaceGeometry Create(
	Surface surface,
	BoundingBoxUV surfaceEnvelope
)
```

## Parameters
- **surface** (`Autodesk.Revit.DB.Surface`) - The Revit surface defining the geometry.
 This BRepBuilderSurfaceGeometry stores a copy of the input surface.
- **surfaceEnvelope** (`Autodesk.Revit.DB.BoundingBoxUV`) - Envelope of the surface in the uv parametric domain. Defines the domain of interest for the created surface.
 This is typically used to identify the domain of the face that references the surface in question.
 Expected to either be null or define a valid domain.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - A surface of this type can not be used as a part of the geometry generated by BRepBuilder.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null